app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `estado` = '1'
SELECT COUNT(*) AS `numrows`
FROM `clientes`
WHERE `estado` = '1'
SELECT COUNT(*) AS `numrows`
FROM `prestamos`
WHERE `estado` = '1'
SELECT COUNT(*) AS `numrows`
FROM `vehiculos`
WHERE `estado` = '1'
---
    public function dashboard()
    {
        $this->usuarios = new UsuariosModel();
        $this->clientes = new ClientesModel();
        $this->cajas = new CajasModel();
        $this->vehiculos = new VehiculosModel();

        /* No se estan usando */
        $this->fabricantes = new FabricantesModel();
        $this->modelos = new ModelosModel();
        /**/
        $data['usuarios'] = $this->usuarios->where('estado', '1')->countAllResults();
        $data['clientes'] = $this->clientes->where('estado', '1')->countAllResults();
        $data['prestamos'] = $this->prestamos->where('estado', '1')->countAllResults();
        $data['vehiculos'] = $this->vehiculos->where('estado', '1')->countAllResults();
        $data['fabricantes'] = $this->vehiculos->where('estado', '1')->countAllResults();
        $data['modelos'] = $this->vehiculos->where('estado', '1')->countAllResults();