app/Controllers/PrestamosController.php

SELECT `prestamos`.*, `c`.`identidad`, `c`.`num_identidad`, `c`.`nombre` AS `cliente`, `c`.`apellido`, `c`.`telefono`, `c`.`whatsapp`, `c`.`correo`, `v`.`vin`, `v`.`id_fabricante`, `v`.`id_modelo`, `v`.`precio`, `u`.`nombre` AS `usuario`, `u`.`apellido` AS `user_apellido`
FROM `prestamos`
JOIN `clientes` AS `c` ON `prestamos`.`id_cliente` = `c`.`id`
JOIN `vehiculos` AS `v` ON `prestamos`.`id_vehiculo` = `v`.`id`
JOIN `usuarios` AS `u` ON `prestamos`.`id_usuario` = `u`.`id`
WHERE `prestamos`.`id` = '31'
 LIMIT 1
---
    public function detail($id)
    {
        if (!verificar('ver prestamo', $this->session->permisos)) {
            return view('permisos');
            exit;
        }
        $data['prestamo'] = $this->prestamos
            ->select('prestamos.*, c.identidad, c.num_identidad, c.nombre AS cliente, c.apellido, c.telefono, c.whatsapp, c.correo, v.vin, v.id_fabricante, v.id_modelo, v.precio, u.nombre AS usuario, u.apellido AS user_apellido')
            ->join('clientes AS c', 'prestamos.id_cliente = c.id')
            ->join('vehiculos AS v', 'prestamos.id_vehiculo = v.id')
            ->join('usuarios AS u', 'prestamos.id_usuario = u.id')
            ->where('prestamos.id', $id)->first();

UPDATE `prestamos` SET `estado` = 2, `updated_at` = '2023-11-27 14:17:06'
WHERE `id` = '31'
---
                                ])
                                ->countAllResults();
                            if($count_now==0){
                                $this->prestamos->where(['id'=>$id_prestamo])->set(['estado'=>2])->update();